[
  {
    "q": "What do you call someone who doesn't fart in public?",
    "a": "A private tutor!"
  },
  {
    "q": "I was walking down the road when I saw a TV for sale in a shop window. The sign said \"TV cheap, broken volume knob\". I thought to myself \"wow, I can't turn that down!\""
  },
  {
    "q": "Why did the Earth do the dishes?",
    "a": "To wash its continental plates."
  },
  {
    "q": "Why did the bike collapse?",
    "a": "He was just two tired."
  },
  {
    "q": "Two peanuts were walking down the street. One of them was a-salted."
  },
  {
    "q": "Helvetica and Times New Roman walk into a bar. \"Get out of here!\" shouts the bartender. \"We don’t serve your type.\""
  },
  {
    "q": "What does a nosy pepper do?",
    "a": "Gets jalapeño business!"
  },
  {
    "q": "Where does the General keep his armies",
    "a": "In his sleevies"
  },
  {
    "q": "Why did the chicken cross the road",
    "a": "To eat the corn on the other side"
  },
  {
    "q": "What's the difference between a knight and Santa's reindeer?",
    "a": "One slays the dragon, and the other's draggin' the sleigh."
  },
  {
    "q": "How do you tell the difference between an alligator and a crocodile?",
    "a": " You will see one later and one in a while"
  },
  {
    "q": "In Sweden, all government-owned ships are required to have a UPC code printed on the hull. When the ships are returned to port, it helps them Scandinavian"
  },
  {
    "q": "Did you hear about the mathematician who’s afraid of negative numbers?",
    "a": "He’ll stop at nothing to avoid them."
  },
  {
    "q": "My favorite Christmas breakfast is Eggs Benedict served on a hubcap.",
    "a": "There's no place like chrome for the hollandaise."
  },
  {
    "q": "Tomorrow, I get to meet Phil Collins",
    "a": "I’ve been waiting for this moment all my life"
  },
  {
    "q": "I just went the doctors, turns out I’m colourblind",
    "a": "The results came completely out of the purple!"
  },
  {
    "q": "You know where I store all my dad jokes?",
    "a": "in a dad - a - base"
  },
  {
    "q": "How do elves measure their height?",
    "a": "In Santa-meters!"
  },
  {
    "q": "There are 10 types of people in the world - those who understand binary and those who don't."
  },
  {
    "q": "There are 2 hard problems in computer science: cache invalidation, naming things, and off-by-1 errors."
  },
  {
    "q": "What's stronger than a fortune cookie?",
    "a": "A hammer"
  },
  {
    "q": "When I was a kid, my parents used to make me walk the plank",
    "a": "We couldn't afford a dog."
  },
  {
    "q": "Why do developers never put horse-drawn carriages in their games?",
    "a": "They can be buggy"
  },
  {
    "q": "How much does Santa pay to park his sleigh?",
    "a": "Nothing, it’s on the house."
  },
  {
    "q": "Why Santa tell Mrs. Claus to carry an umbrella?",
    "a": "Because it looks like rain dear."
  }
]
